# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
data1=pd.Series(np.random.randint(1,4,100))
data2=pd.Series(np.random.randint(1,3,100))
data3=pd.Series(np.random.randint(10000,30000,100))

In [3]:
display(data1,data2,data3)

0     2
1     2
2     3
3     2
4     1
     ..
95    1
96    1
97    2
98    1
99    1
Length: 100, dtype: int32

0     1
1     1
2     1
3     2
4     2
     ..
95    2
96    2
97    1
98    1
99    1
Length: 100, dtype: int32

0     19917
1     26626
2     19046
3     19317
4     19525
      ...
95    19574
96    14192
97    29831
98    23302
99    15796
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:

house=pd.concat([data1,data2,data3],axis=1)

house

    0  1      2
0   2  1  19917
1   2  1  26626
2   3  1  19046
3   2  2  19317
4   1  2  19525
.. .. ..    ...
95  1  2  19574
96  1  2  14192
97  2  1  29831
98  1  1  23302
99  1  1  15796

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
house.rename(columns={0:'besrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)

house

    besrs  bathrs  price_sqr_meter
0       2       1            19917
1       2       1            26626
2       3       1            19046
3       2       2            19317
4       1       2            19525
..    ...     ...              ...
95      1       2            19574
96      1       2            14192
97      2       1            29831
98      1       1            23302
99      1       1            15796

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [6]:
bigcolumn = pd.concat([data1,data2, data3], axis=0)
pd.DataFrame(bigcolumn)

        0
0       2
1       2
2       3
3       2
4       1
..    ...
95  19574
96  14192
97  29831
98  23302
99  15796

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [7]:
bigcolumn.value_counts().sum()

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [8]:
bigcolumn.reset_index(drop=True,inplace=True)

In [9]:
bigcolumn

0          2
1          2
2          3
3          2
4          1
       ...
295    19574
296    14192
297    29831
298    23302
299    15796
Length: 300, dtype: int32